#Область СлужебныеПроцедурыИФункции

// Процедура определения списка объектов, для которых доступна
// команда определения печатных форм. Необходимо для возможности
// подключения внешних печатных форм к документам.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	Для Каждого ТекДокумент Из Метаданные.Документы Цикл
		
		ИмяДокумента = ТекДокумент.Имя;
		Если СтрНайти(ИмяДокумента, "МРГ") > 0 Или СтрНайти(ИмяДокумента, "ГРО") > 0 Тогда
			СписокОбъектов.Добавить(Документы[ИмяДокумента]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти